In [1]:
#Importing libraries
import pandas as pd
import numpy as np
import os

In [2]:
#Create dataframe
df_test=pd.DataFrame()

In [3]:
df_test['Mix']=['a','b',1,True]

In [4]:
df_test

    Mix
0     a
1     b
2     1
3  True

In [5]:
for col in df_test.columns.tolist():
    weird=(df_test[[col]].applymap(type)!=df_test[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_test[weird])>0:
        print(col)

Mix

In [6]:
df_prods=pd.read_csv(r'/Users/angitha/Achievement 4.5/Data/Original data/products.csv',index_col=False)

In [7]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [8]:
df_nan=df_prods[df_prods['product_name'].isnull()==True]

In [9]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [10]:
df_test['Mix'] = df_test['Mix'].astype('str')

In [11]:
df_test['Mix']

0       a
1       b
2       1
3    True
Name: Mix, dtype: object

In [12]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [13]:
df_nan=df_prods[df_prods['product_name'].isnull()==True]

In [14]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [15]:
df_prods.shape

(49693, 5)

In [16]:
df_prods_clean=df_prods[df_prods['product_name'].isnull()==False]

In [17]:
df_prods_clean.shape

(49677, 5)

In [18]:
df_dups=df_prods_clean[df_prods_clean.duplicated()]

In [19]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [20]:
df_prods_clean.shape

(49677, 5)

In [21]:
df_prods_clean_no_dups=df_prods_clean.drop_duplicates()

In [22]:
df_prods_clean_no_dups

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

#TASK 4.5

In [23]:
#Import csv file for order
df_ords=pd.read_csv(r'/Users/angitha/Achievement 4.5/Data/Original data/orders.csv',index_col=False)

In [24]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,985475.000000
mean,1.710968e+06,3.156404e+04,1.717418e+01,2.778637e+00,1.345229e+01,11.102506
std,9.875774e+05,1.816695e+04,1.771094e+01,2.047751e+00,4.219144e+00,9.186663
min,6.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000
25%,8.554670e+05,1.589600e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000
50%,1.710657e+06,3.160800e+04,1.100000e+01,3.000000e+00,1.300000e+01,7.000000
75%,2.566970e+06,4.729700e+04,2.300000e+01,5.000000e+00,1.600000e+01,15.000000
max,3.421083e+06,6.310000e+04,1.000000e+02,6.000000e+00,2.300000e+01,30.000000

In [25]:
#Check for mixed-type data
for col in df_ords.columns.tolist():
    weird=(df_ords[[col]].applymap(type)!=df_ords[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_ords[weird])>0:
        print(col)

Answer 4. There is no mixed_type data in the dataframe 'order'.

In [26]:
#Checking for missing values
df_ords.isnull().sum()

order_id                      0
user_id                       0
eval_set                      0
order_number                  0
order_dow                     0
order_hour_of_day             0
days_since_prior_order    63100
dtype: int64

In [27]:
df_ords_nan=df_ords[df_ords['days_since_prior_order'].isnull()==True]

In [28]:
df_ords_nan

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
1048523,1591766,63096,prior,1,0,20,NaN
1048530,3391694,63097,prior,1,2,14,NaN
1048541,1270497,63098,prior,1,3,16,NaN
1048556,1877750,63099,prior,1,0,10,NaN
1048570,1805240,63100,prior,1,0,11,NaN

In [29]:
df_ords['order_number'].value_counts(dropna = False)

1      63100
2      63100
3      63100
4      63100
5      55665
       ...
96       480
97       461
98       447
99       438
100      431
Name: order_number, Length: 100, dtype: int64

In [30]:
df_ords['user_id'].value_counts(dropna = False)

6494     100
9513     100
6268     100
4693     100
16680    100
        ...
36182      4
36179      4
13949      4
49787      4
29008      4
Name: user_id, Length: 63100, dtype: int64

Answer 5. The missing values in the column 'days_since_prior_order' when considered connecting with the columns 'user_id' and 'order_number' gives the information that most of the orders are the first one and the column 'days_since_prior_order' will only get update after the second order.

Answer 6. The above explanation says that the column doesnt need to be imputed for the missing values.

In [31]:
#Checking for duplicate values
df_dups=df_ords[df_ords.duplicated()]

In [32]:
df_ords.shape

(1048575, 7)

In [33]:
df_prods.shape

(49693, 5)

Answer 7 & 8. there were no duplicate values foundin the dataframe'order'.

In [34]:
path=r'/Users/angitha/Achievement 4.5'

In [35]:
#Exporting df_prods as csv
df_prods.to_csv(os.path.join(path,'Data','Prepared Data','products_checked.csv'))

In [36]:
#Exporting df_ords as csv
df_ords.to_csv(os.path.join(path,'Data','Prepared Data','orders_checked.csv'))